Extensions/FortMonitorAPI_ТЛЭ/DataProcessors/SDL_ЗагрузкаДанныхФортМонитор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>SDL_ЗагрузкаДанныхФортМонитор</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Comment>Дата начала периода</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Comment>Дата окончания периода</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/Catalogs/уатТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уатТС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИДвСистемеНавигации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользуемаяСистемаGPS</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/DataProcessors/SDL_ЗагрузкаДанныхФортМонитор/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроизвольныйПериод         = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант = ВариантСтандартногоПериода.Вчера;
	Объект.ДатаС               = ПроизвольныйПериод.ДатаНачала;
	Объект.ДатаПо              = ПроизвольныйПериод.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТС

&НаКлиенте
Процедура ТСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Состояние(НСтр("ru = 'Добавлено ТС'") + " <" + Строка(ВыбранноеЗначение) + ">",,, БиблиотекаКартинок.Информация32);
	
	НайдСтроки = ТС.НайтиСтроки(Новый Структура("Ссылка", ВыбранноеЗначение));
	Если НайдСтроки.Количество() = 0 Тогда 
		НовСтрока = ТС.Добавить();
		НовСтрока.Ссылка = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	ТекстОшибки = "";
	Отказ = Ложь;
	
	Если ТС.Количество() = 0 Тогда 
		ТекстОшибки = "Не выбрано ни одного ТС";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ТС",,Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаС) Тогда 
		ТекстОшибки = "Не заполнена дата начала загрузки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ДатаС",,Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПо) Тогда 
		ТекстОшибки = "Не заполнена дата окончания загрузки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ДатаПо",,Отказ);
	КонецЕсли;
	
	Если Объект.ДатаС > Объект.ДатаПо Тогда 
		ТекстОшибки = "Дата начала загрузки не может быть больше даты окончания";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ДатаС",,Отказ);
	КонецЕсли;
	
	Если Не ЗагрузитьПробегРасход И Не ЗагрузитьДополнительныеСведения И Не ЗагрузитьКоординаты Тогда 
		ТекстОшибки = "Необходимо выбрать хотя бы один параметр для загрузки (пробег и расход/дополнительные сведения/координаты)";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ЗагрузитьПробегИРасходГСМ",,Отказ);
	КонецЕсли;
	
	// Выполним загрузку
	Если Не Отказ Тогда 
		ЗагрузитьДанныеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	ПроизвольныйПериод               = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПроизвольныйПериод.ДатаНачала    = Объект.ДатаС;
	ПроизвольныйПериод.ДатаОкончания = Объект.ДатаПо;
	
	ДиалогВыбораПериода        = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период = ПроизвольныйПериод;
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалОбработкаВыбораПериода", ЭтотОбъект);
	ДиалогВыбораПериода.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТС(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.уатТС.ФормаВыбора", ПараметрыФормы, Элементы.ТС,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиТС(Команда)
	
	Если ТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЗаполнитьВсемиТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена
		);
		
	Иначе 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалОбработкаВыбораПериода(Период, Параметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаС  = Период.ДатаНачала;
	Объект.ДатаПо = Период.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТС(Команда)
	
	Если ТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОчиститьТаблицуТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table?';ru='Очистить таблицу?'"),
			РежимДиалогаВопрос.ДаНет
		);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТС.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьДанныеНаСервере()
	
	// Массив идентификаторов транспортных средств в системе навигации
	МассивСсылокТС = ТС.Выгрузить(, "Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатТС.ИДвСистемеНавигации КАК ИДвСистемеНавигации
		|ИЗ
		|	Справочник.уатТС КАК уатТС
		|ГДЕ
		|	уатТС.Ссылка В(&МассивСсылокТС)";
	
	Запрос.УстановитьПараметр("МассивСсылокТС", МассивСсылокТС);
	
	ИдентификаторыТС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИДвСистемеНавигации");
	
	
	МассивVehicleID = SDL_ФортМонитор.МассивVehicleID(ИдентификаторыТС);
	
	
	Если НЕ ЗначениеЗаполнено(МассивVehicleID) Тогда
		Возврат;
	КонецЕсли;
	
	// Загрузка данных 
	Если ЗагрузитьКоординаты Тогда 
		
		SDL_ФортМонитор.Заполнить_КоординатыПоМониторингу(Объект.ДатаС, Объект.ДатаПо, МассивVehicleID); // Запись уатКоординатыПоМониторингу из данного сервиса отключена
		
	КонецЕсли;
	
	Если ЗагрузитьДополнительныеСведения Тогда 
		
		SDL_ФортМонитор.ОжиданиеПинг(3);		
		SDL_ФортМонитор.Заполнить_уатДополнительныеСведенияПоGPS(Объект.ДатаС, Объект.ДатаПо, МассивVehicleID);
		
	КонецЕсли;
	
	Если ЗагрузитьПробегРасход Тогда 
		
		SDL_ФортМонитор.ОжиданиеПинг(3);
		
		// СК 11.04.2023
		SDL_ФортМонитор.Заполнить_уатПробегРасходПоМониторингу(Объект.ДатаС, Объект.ДатаПо, МассивVehicleID);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТС.Очистить();
		ЗаполнитьВсемиТСЗавершение();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиТСЗавершение()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатТС КАК уатТС
	|ГДЕ
	|	НЕ уатТС.ПометкаУдаления
	|	И НЕ уатТС.ЭтоГруппа
	|	И уатТС.ИспользуемаяСистемаGPS = &СистемаМониторинга
	|	И НЕ уатТС.ИДвСистемеНавигации = """"";
	
	Запрос.УстановитьПараметр("СистемаМониторинга", SDL_ФортМонитор.СистемаМониторингаФортМонитор());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НовСтрока = ТС.Добавить();
		НовСтрока.Ссылка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти
